In [1]:
import pandas as pd
import seaborn as sns

tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [2]:
tips_grouped = tips.groupby('time', observed=True)
tips_grouped

In [3]:
tips_grouped[['tip']].mean()

             tip
time
Lunch   2.728088
Dinner  3.102670

In [4]:
tips.groupby('day', observed=True)[['total_bill']].max()

      total_bill
day
Thur       43.11
Fri        40.17
Sat        50.81
Sun        48.17

In [5]:
tips.groupby(['day', 'time'], observed=True)[['tip']].min()

              tip
day  time
Thur Lunch   1.25
     Dinner  3.00
Fri  Lunch   1.58
     Dinner  1.00
Sat  Dinner  1.00
Sun  Dinner  1.01

In [6]:
tips.groupby(['day', 'time'], observed=True)[['tip']].agg(['mean', 'sum'])

                  tip
                 mean     sum
day  time
Thur Lunch   2.767705  168.83
     Dinner  3.000000    3.00
Fri  Lunch   2.382857   16.68
     Dinner  2.940000   35.28
Sat  Dinner  2.993103  260.40
Sun  Dinner  3.255132  247.39